{"format": "graph-model", "generatedBy": "2.15.0", "convertedBy": "TensorFlow.js Converter v4.10.0", "signature": {"outputs": {"PartitionedCall": {"name": "PartitionedCall"}}}, "modelTopology": {"node": [{"name": "Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "1"}, {"size": "3"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "1"}, {"size": "3"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_4", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "32"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "Const_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "8"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "32"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_10", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}, {"size": "16"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "Const_11", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}}, {"name": "Const_12", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}, {"size": "1"}, {"size": "3"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_13", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_14", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "96"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_15", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_16", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}, {"size": "4"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "Const_17", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}}, {"name": "Const_18", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}, {"size": "96"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "Const_19", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}}}, {"name": "Const_20", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}, {"size": "24"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "Const_21", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_22", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}, {"size": "1"}, {"size": "3"}, {"size": "3"}]}}}}}, {"name": "Const_23", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_24", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}, {"size": "144"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "Const_25", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}}}}, {"name": "Const_26", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}, {"size": "6"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "Const_27", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_28", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}, {"size": "144"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_29", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}}}, {"name": "Const_30", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}, {"size": "24"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_31", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_32", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}, {"size": "1"}, {"size": "5"}, {"size": "5"}]}}}}}, {"name": "Const_33", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}]}}}}}, {"name": "Const_34", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}, {"size": "144"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_35", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}}}}, {"name": "Const_36", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}, {"size": "6"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_37", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}]}}}}}, {"name": "Const_38", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "40"}, {"size": "144"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "Const_39", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_40", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "240"}, {"size": "40"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_41", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "240"}]}}}}}, {"name": "Const_42", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "240"}, {"size": "1"}, {"size": "5"}, {"size": "5"}]}}}}}, {"name": "Const_43", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "240"}]}}}}}, {"name": "Const_44", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "240"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_45", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}}}, {"name": "Const_46", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "240"}, {"size": "10"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "Const_47", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "240"}]}}}}}, {"name": "Const_48", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "40"}, {"size": "240"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_49", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_50", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "240"}, {"size": "40"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "Const_51", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "240"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_52", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "240"}, {"size": "1"}, {"size": "3"}, {"size": "3"}]}}}}}, {"name": "Const_53", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "240"}]}}}}}, {"name": "Const_54", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "240"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_55", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}}}, {"name": "Const_56", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "240"}, {"size": "10"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_57", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "240"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_58", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "80"}, {"size": "240"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_59", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "80"}]}}}}}, {"name": "Const_60", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "480"}, {"size": "80"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_61", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "480"}]}}}}}, {"name": "Const_62", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "480"}, {"size": "1"}, {"size": "3"}, {"size": "3"}]}}}}}, {"name": "Const_63", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "480"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_64", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}, {"size": "480"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "Const_65", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_66", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "480"}, {"size": "20"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "Const_67", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "480"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_68", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "80"}, {"size": "480"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "Const_69", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "80"}]}}}}}, {"name": "Const_70", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "480"}, {"size": "80"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "Const_71", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "480"}]}}}}}, {"name": "Const_72", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "480"}, {"size": "1"}, {"size": "3"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_73", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "480"}]}}}}}, {"name": "Const_74", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}, {"size": "480"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_75", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}]}}}}}, {"name": "Const_76", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "480"}, {"size": "20"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "Const_77", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "480"}]}}}}}, {"name": "Const_78", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "80"}, {"size": "480"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_79", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "80"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_80", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "480"}, {"size": "80"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_81", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "480"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_82", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "480"}, {"size": "1"}, {"size": "5"}, {"size": "5"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_83", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "480"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_84", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}, {"size": "480"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "Const_85", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}]}}}}}, {"name": "Const_86", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "480"}, {"size": "20"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_87", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "480"}]}}}}}, {"name": "Const_88", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "112"}, {"size": "480"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_89", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "112"}]}}}}}, {"name": "Const_90", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "672"}, {"size": "112"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_91", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "672"}]}}}}}, {"name": "Const_92", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "672"}, {"size": "1"}, {"size": "5"}, {"size": "5"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_93", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "672"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_94", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "28"}, {"size": "672"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_95", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "28"}]}}}}}, {"name": "Const_96", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "672"}, {"size": "28"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "Const_97", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "672"}]}}}}}, {"name": "Const_98", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "112"}, {"size": "672"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "Const_99", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "112"}]}}}}}, {"name": "Const_100", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "672"}, {"size": "112"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "Const_101", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "672"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_102", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "672"}, {"size": "1"}, {"size": "5"}, {"size": "5"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_103", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "672"}]}}}}}, {"name": "Const_104", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "28"}, {"size": "672"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_105", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "28"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_106", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "672"}, {"size": "28"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "Const_107", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "672"}]}}}}}, {"name": "Const_108", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "112"}, {"size": "672"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "Const_109", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "112"}]}}}}}, {"name": "Const_110", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "672"}, {"size": "112"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "Const_111", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "672"}]}}}}}, {"name": "Const_112", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "672"}, {"size": "1"}, {"size": "5"}, {"size": "5"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_113", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "672"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_114", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "28"}, {"size": "672"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_115", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "28"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_116", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "672"}, {"size": "28"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_117", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "672"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_118", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}, {"size": "672"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_119", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}}, {"name": "Const_120", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1152"}, {"size": "192"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_121", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1152"}]}}}}}, {"name": "Const_122", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1152"}, {"size": "1"}, {"size": "5"}, {"size": "5"}]}}}}}, {"name": "Const_123", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1152"}]}}}}}, {"name": "Const_124", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}, {"size": "1152"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_125", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "Const_126", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1152"}, {"size": "48"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "Const_127", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1152"}]}}}}}, {"name": "Const_128", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}, {"size": "1152"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_129", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}}, {"name": "Const_130", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1152"}, {"size": "192"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "Const_131", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1152"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_132", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1152"}, {"size": "1"}, {"size": "5"}, {"size": "5"}]}}}}}, {"name": "Const_133", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1152"}]}}}}}, {"name": "Const_134", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}, {"size": "1152"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "Const_135", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_136", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1152"}, {"size": "48"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_137", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1152"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_138", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}, {"size": "1152"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "Const_139", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}}, {"name": "Const_140", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1152"}, {"size": "192"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_141", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1152"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_142", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1152"}, {"size": "1"}, {"size": "5"}, {"size": "5"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_143", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1152"}]}}}}}, {"name": "Const_144", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}, {"size": "1152"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "Const_145", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "Const_146", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1152"}, {"size": "48"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_147", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1152"}]}}}}}, {"name": "Const_148", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}, {"size": "1152"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "Const_149", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_150", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1152"}, {"size": "192"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "Const_151", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1152"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_152", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1152"}, {"size": "1"}, {"size": "3"}, {"size": "3"}]}}}}}, {"name": "Const_153", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1152"}]}}}}}, {"name": "Const_154", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}, {"size": "1152"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_155", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_156", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1152"}, {"size": "48"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "Const_157", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1152"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_158", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "320"}, {"size": "1152"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_159", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "320"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_160", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1280"}, {"size": "320"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "Const_161", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1280"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_162", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}, {"size": "1280"}]}}}}}, {"name": "Const_163", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}}}, {"name": "saver_filename", "op": "Placeholder", "attr": {"dtype": {"type": "DT_STRING"}, "shape": {"shape": {}}}}, {"name": "serving_default_melspectrogram", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "64"}, {"size": "128"}, {"size": "96"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall", "op": "PartitionedCall", "input": ["serving_default_melspectrogram", "Const", "Const_1", "Const_2", "Const_3", "Const_4", "Const_5", "Const_6", "Const_7", "Const_8", "Const_9", "Const_10", "Const_11", "Const_12", "Const_13", "Const_14", "Const_15", "Const_16", "Const_17", "Const_18", "Const_19", "Const_20", "Const_21", "Const_22", "Const_23", "Const_24", "Const_25", "Const_26", "Const_27", "Const_28", "Const_29", "Const_30", "Const_31", "Const_32", "Const_33", "Const_34", "Const_35", "Const_36", "Const_37", "Const_38", "Const_39", "Const_40", "Const_41", "Const_42", "Const_43", "Const_44", "Const_45", "Const_46", "Const_47", "Const_48", "Const_49", "Const_50", "Const_51", "Const_52", "Const_53", "Const_54", "Const_55", "Const_56", "Const_57", "Const_58", "Const_59", "Const_60", "Const_61", "Const_62", "Const_63", "Const_64", "Const_65", "Const_66", "Const_67", "Const_68", "Const_69", "Const_70", "Const_71", "Const_72", "Const_73", "Const_74", "Const_75", "Const_76", "Const_77", "Const_78", "Const_79", "Const_80", "Const_81", "Const_82", "Const_83", "Const_84", "Const_85", "Const_86", "Const_87", "Const_88", "Const_89", "Const_90", "Const_91", "Const_92", "Const_93", "Const_94", "Const_95", "Const_96", "Const_97", "Const_98", "Const_99", "Const_100", "Const_101", "Const_102", "Const_103", "Const_104", "Const_105", "Const_106", "Const_107", "Const_108", "Const_109", "Const_110", "Const_111", "Const_112", "Const_113", "Const_114", "Const_115", "Const_116", "Const_117", "Const_118", "Const_119", "Const_120", "Const_121", "Const_122", "Const_123", "Const_124", "Const_125", "Const_126", "Const_127", "Const_128", "Const_129", "Const_130", "Const_131", "Const_132", "Const_133", "Const_134", "Const_135", "Const_136", "Const_137", "Const_138", "Const_139", "Const_140", "Const_141", "Const_142", "Const_143", "Const_144", "Const_145", "Const_146", "Const_147", "Const_148", "Const_149", "Const_150", "Const_151", "Const_152", "Const_153", "Const_154", "Const_155", "Const_156", "Const_157", "Const_158", "Const_159", "Const_160", "Const_161", "Const_162", "Const_163"], "attr": {"Tin": {"list": {"type": ["DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "executor_type": {"s": ""}, "config_proto": {"s": "CgcKA0NQVRABCgcKA0dQVRAAMgJKADgBggEA"}, "Tout": {"list": {"type": ["DT_FLOAT", "DT_FLOAT"]}}, "config": {"s": ""}, "f": {"func": {"name": "__inference_signature_wrapper_2264"}}, "_collective_manager_ids": {"list": {}}, "_read_only_resource_inputs": {"list": {}}}}], "library": {"function": [{"signature": {"name": "__inference___call___1927", "inputArg": [{"name": "melspectrogram", "type": "DT_FLOAT"}, {"name": "transpose_x", "type": "DT_FLOAT"}, {"name": "add_y", "type": "DT_FLOAT"}, {"name": "transpose_3_x", "type": "DT_FLOAT"}, {"name": "add_1_y", "type": "DT_FLOAT"}, {"name": "transpose_6_x", "type": "DT_FLOAT"}, {"name": "add_2_y", "type": "DT_FLOAT"}, {"name": "transpose_9_x", "type": "DT_FLOAT"}, {"name": "add_3_y", "type": "DT_FLOAT"}, {"name": "transpose_12_x", "type": "DT_FLOAT"}, {"name": "add_4_y", "type": "DT_FLOAT"}, {"name": "transpose_15_x", "type": "DT_FLOAT"}, {"name": "add_5_y", "type": "DT_FLOAT"}, {"name": "transpose_18_x", "type": "DT_FLOAT"}, {"name": "add_6_y", "type": "DT_FLOAT"}, {"name": "transpose_21_x", "type": "DT_FLOAT"}, {"name": "add_7_y", "type": "DT_FLOAT"}, {"name": "transpose_24_x", "type": "DT_FLOAT"}, {"name": "add_8_y", "type": "DT_FLOAT"}, {"name": "transpose_27_x", "type": "DT_FLOAT"}, {"name": "add_9_y", "type": "DT_FLOAT"}, {"name": "transpose_30_x", "type": "DT_FLOAT"}, {"name": "add_10_y", "type": "DT_FLOAT"}, {"name": "transpose_33_x", "type": "DT_FLOAT"}, {"name": "add_11_y", "type": "DT_FLOAT"}, {"name": "transpose_36_x", "type": "DT_FLOAT"}, {"name": "add_12_y", "type": "DT_FLOAT"}, {"name": "transpose_39_x", "type": "DT_FLOAT"}, {"name": "add_13_y", "type": "DT_FLOAT"}, {"name": "transpose_42_x", "type": "DT_FLOAT"}, {"name": "add_14_y", "type": "DT_FLOAT"}, {"name": "transpose_45_x", "type": "DT_FLOAT"}, {"name": "add_15_y", "type": "DT_FLOAT"}, {"name": "transpose_48_x", "type": "DT_FLOAT"}, {"name": "add_16_y", "type": "DT_FLOAT"}, {"name": "transpose_51_x", "type": "DT_FLOAT"}, {"name": "add_17_y", "type": "DT_FLOAT"}, {"name": "transpose_54_x", "type": "DT_FLOAT"}, {"name": "add_18_y", "type": "DT_FLOAT"}, {"name": "transpose_57_x", "type": "DT_FLOAT"}, {"name": "add_19_y", "type": "DT_FLOAT"}, {"name": "transpose_60_x", "type": "DT_FLOAT"}, {"name": "add_20_y", "type": "DT_FLOAT"}, {"name": "transpose_63_x", "type": "DT_FLOAT"}, {"name": "add_21_y", "type": "DT_FLOAT"}, {"name": "transpose_66_x", "type": "DT_FLOAT"}, {"name": "add_22_y", "type": "DT_FLOAT"}, {"name": "transpose_69_x", "type": "DT_FLOAT"}, {"name": "add_23_y", "type": "DT_FLOAT"}, {"name": "transpose_72_x", "type": "DT_FLOAT"}, {"name": "add_24_y", "type": "DT_FLOAT"}, {"name": "transpose_75_x", "type": "DT_FLOAT"}, {"name": "add_25_y", "type": "DT_FLOAT"}, {"name": "transpose_78_x", "type": "DT_FLOAT"}, {"name": "add_26_y", "type": "DT_FLOAT"}, {"name": "transpose_81_x", "type": "DT_FLOAT"}, {"name": "add_27_y", "type": "DT_FLOAT"}, {"name": "transpose_84_x", "type": "DT_FLOAT"}, {"name": "add_28_y", "type": "DT_FLOAT"}, {"name": "transpose_87_x", "type": "DT_FLOAT"}, {"name": "add_29_y", "type": "DT_FLOAT"}, {"name": "transpose_90_x", "type": "DT_FLOAT"}, {"name": "add_30_y", "type": "DT_FLOAT"}, {"name": "transpose_93_x", "type": "DT_FLOAT"}, {"name": "add_31_y", "type": "DT_FLOAT"}, {"name": "transpose_96_x", "type": "DT_FLOAT"}, {"name": "add_32_y", "type": "DT_FLOAT"}, {"name": "transpose_99_x", "type": "DT_FLOAT"}, {"name": "add_33_y", "type": "DT_FLOAT"}, {"name": "transpose_102_x", "type": "DT_FLOAT"}, {"name": "add_34_y", "type": "DT_FLOAT"}, {"name": "transpose_105_x", "type": "DT_FLOAT"}, {"name": "add_35_y", "type": "DT_FLOAT"}, {"name": "transpose_108_x", "type": "DT_FLOAT"}, {"name": "add_36_y", "type": "DT_FLOAT"}, {"name": "transpose_111_x", "type": "DT_FLOAT"}, {"name": "add_37_y", "type": "DT_FLOAT"}, {"name": "transpose_114_x", "type": "DT_FLOAT"}, {"name": "add_38_y", "type": "DT_FLOAT"}, {"name": "transpose_117_x", "type": "DT_FLOAT"}, {"name": "add_39_y", "type": "DT_FLOAT"}, {"name": "transpose_120_x", "type": "DT_FLOAT"}, {"name": "add_40_y", "type": "DT_FLOAT"}, {"name": "transpose_123_x", "type": "DT_FLOAT"}, {"name": "add_41_y", "type": "DT_FLOAT"}, {"name": "transpose_126_x", "type": "DT_FLOAT"}, {"name": "add_42_y", "type": "DT_FLOAT"}, {"name": "transpose_129_x", "type": "DT_FLOAT"}, {"name": "add_43_y", "type": "DT_FLOAT"}, {"name": "transpose_132_x", "type": "DT_FLOAT"}, {"name": "add_44_y", "type": "DT_FLOAT"}, {"name": "transpose_135_x", "type": "DT_FLOAT"}, {"name": "add_45_y", "type": "DT_FLOAT"}, {"name": "transpose_138_x", "type": "DT_FLOAT"}, {"name": "add_46_y", "type": "DT_FLOAT"}, {"name": "transpose_141_x", "type": "DT_FLOAT"}, {"name": "add_47_y", "type": "DT_FLOAT"}, {"name": "transpose_144_x", "type": "DT_FLOAT"}, {"name": "add_48_y", "type": "DT_FLOAT"}, {"name": "transpose_147_x", "type": "DT_FLOAT"}, {"name": "add_49_y", "type": "DT_FLOAT"}, {"name": "transpose_150_x", "type": "DT_FLOAT"}, {"name": "add_50_y", "type": "DT_FLOAT"}, {"name": "transpose_153_x", "type": "DT_FLOAT"}, {"name": "add_51_y", "type": "DT_FLOAT"}, {"name": "transpose_156_x", "type": "DT_FLOAT"}, {"name": "add_52_y", "type": "DT_FLOAT"}, {"name": "transpose_159_x", "type": "DT_FLOAT"}, {"name": "add_53_y", "type": "DT_FLOAT"}, {"name": "transpose_162_x", "type": "DT_FLOAT"}, {"name": "add_54_y", "type": "DT_FLOAT"}, {"name": "transpose_165_x", "type": "DT_FLOAT"}, {"name": "add_55_y", "type": "DT_FLOAT"}, {"name": "transpose_168_x", "type": "DT_FLOAT"}, {"name": "add_56_y", "type": "DT_FLOAT"}, {"name": "transpose_171_x", "type": "DT_FLOAT"}, {"name": "add_57_y", "type": "DT_FLOAT"}, {"name": "transpose_174_x", "type": "DT_FLOAT"}, {"name": "add_58_y", "type": "DT_FLOAT"}, {"name": "transpose_177_x", "type": "DT_FLOAT"}, {"name": "add_59_y", "type": "DT_FLOAT"}, {"name": "transpose_180_x", "type": "DT_FLOAT"}, {"name": "add_60_y", "type": "DT_FLOAT"}, {"name": "transpose_183_x", "type": "DT_FLOAT"}, {"name": "add_61_y", "type": "DT_FLOAT"}, {"name": "transpose_186_x", "type": "DT_FLOAT"}, {"name": "add_62_y", "type": "DT_FLOAT"}, {"name": "transpose_189_x", "type": "DT_FLOAT"}, {"name": "add_63_y", "type": "DT_FLOAT"}, {"name": "transpose_192_x", "type": "DT_FLOAT"}, {"name": "add_64_y", "type": "DT_FLOAT"}, {"name": "transpose_195_x", "type": "DT_FLOAT"}, {"name": "add_65_y", "type": "DT_FLOAT"}, {"name": "transpose_198_x", "type": "DT_FLOAT"}, {"name": "add_66_y", "type": "DT_FLOAT"}, {"name": "transpose_201_x", "type": "DT_FLOAT"}, {"name": "add_67_y", "type": "DT_FLOAT"}, {"name": "transpose_204_x", "type": "DT_FLOAT"}, {"name": "add_68_y", "type": "DT_FLOAT"}, {"name": "transpose_207_x", "type": "DT_FLOAT"}, {"name": "add_69_y", "type": "DT_FLOAT"}, {"name": "transpose_210_x", "type": "DT_FLOAT"}, {"name": "add_70_y", "type": "DT_FLOAT"}, {"name": "transpose_213_x", "type": "DT_FLOAT"}, {"name": "add_71_y", "type": "DT_FLOAT"}, {"name": "transpose_216_x", "type": "DT_FLOAT"}, {"name": "add_72_y", "type": "DT_FLOAT"}, {"name": "transpose_219_x", "type": "DT_FLOAT"}, {"name": "add_73_y", "type": "DT_FLOAT"}, {"name": "transpose_222_x", "type": "DT_FLOAT"}, {"name": "add_74_y", "type": "DT_FLOAT"}, {"name": "transpose_225_x", "type": "DT_FLOAT"}, {"name": "add_75_y", "type": "DT_FLOAT"}, {"name": "transpose_228_x", "type": "DT_FLOAT"}, {"name": "add_76_y", "type": "DT_FLOAT"}, {"name": "transpose_231_x", "type": "DT_FLOAT"}, {"name": "add_77_y", "type": "DT_FLOAT"}, {"name": "transpose_234_x", "type": "DT_FLOAT"}, {"name": "add_78_y", "type": "DT_FLOAT"}, {"name": "transpose_237_x", "type": "DT_FLOAT"}, {"name": "add_79_y", "type": "DT_FLOAT"}, {"name": "transpose_240_x", "type": "DT_FLOAT"}, {"name": "add_80_y", "type": "DT_FLOAT"}, {"name": "transpose_243_x", "type": "DT_FLOAT"}, {"name": "mul_1_y", "type": "DT_FLOAT"}], "outputArg": [{"name": "identity_1", "type": "DT_FLOAT"}, {"name": "identity_2", "type": "DT_FLOAT"}]}, "nodeDef": [{"name": "__inference___call___1927/mul_1/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "_output_shapes": {"list": {"shape": [{}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference___call___1927/ConstantFolding/split_76-folded-1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference___call___1927/transpose_232/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "_output_shapes": {"list": {"shape": [{"dim": [{"size": "4"}]}]}}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "__inference___call___1927/transpose_231/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "_output_shapes": {"list": {"shape": [{"dim": [{"size": "4"}]}]}}}}, {"name": "__inference___call___1927/transpose_233/perm", "op": "Const", "attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "4"}]}]}}, "dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "__inference___call___1927/transpose_235/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}, "_output_shapes": {"list": {"shape": [{"dim": [{"size": "4"}]}]}}}}, {"name": "__inference___call___1927/transpose_234/perm", "op": "Const", "attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "4"}]}]}}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference___call___1927/transpose_236/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "_output_shapes": {"list": {"shape": [{"dim": [{"size": "4"}]}]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference___call___1927/ConstantFolding/split_71-folded-1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference___call___1927/transpose_217/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}, "_output_shapes": {"list": {"shape": [{"dim": [{"size": "4"}]}]}}}}, {"name": "__inference___call___1927/transpose_216/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}, "_output_shapes": {"list": {"shape": [{"dim": [{"size": "4"}]}]}}}}, {"name": "__inference___call___1927/transpose_218/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "_output_shapes": {"list": {"shape": [{"dim": [{"size": "4"}]}]}}}}, {"name": "__inference___call___1927/transpose_220/perm", "op": "Const", "attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "4"}]}]}}, "dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "__inference___call___1927/transpose_219/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "_output_shapes": {"list": {"shape": [{"dim": [{"size": "4"}]}]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference___call___1927/transpose_221/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "_output_shapes": {"list": {"shape": [{"dim": [{"size": "4"}]}]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference___call___1927/transpose_211/perm", "op": "Const", "attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "4"}]}]}}, "dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "__inference___call___1927/transpose_210/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}, "_output_shapes": {"list": {"shape": [{"dim": [{"size": "4"}]}]}}}}, {"name": "__inference___call___1927/transpose_212/perm", "op": "Const", "attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "4"}]}]}}, "dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "__inference___call___1927/Const_15", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "_output_shapes": {"list": {"shape": [{"dim": [{"size": "4"}, {"size": "2"}]}]}}}}, {"name": "__inference___call___1927/transpose_214/perm", "op": "Const", "attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "4"}]}]}}, "dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "__inference___call___1927/transpose_213/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "_output_shapes": {"list": {"shape": [{"dim": [{"size": "4"}]}]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference___call___1927/Reshape_14/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "_output_shapes": {"list": {"shape": [{"dim": [{"size": "4"}]}]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference___call___1927/transpose_215/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "_output_shapes": {"list": {"shape": [{"dim": [{"size": "4"}]}]}}}}, {"name": "__inference___call___1927/transpose_223/perm", "op": "Const", "attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "4"}]}]}}, "dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "__inference___call___1927/transpose_222/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "_output_shapes": {"list": {"shape": [{"dim": [{"size": "4"}]}]}}}}, {"name": 